import {Injectable} from '@angular/core';

@Injectable()
export class ConsumablesService {
    public consumables:Array<any> = [
        {
            "id": 1,
            "category":"consumables",
            "name": "Листен Тор",
            "en_name": "leavehumus",
            "description": `Листните торове при растенията са като добавките към
            фуражите за животните. Не могат да ги нахранят и да заместят основната
            храна, но вдигат бързо прираста. Следователно ако не могат да заместят
            основното торене. Те са за коригиране на минералното хранене на посевите
            при недостиг на определени вещества, за подобряване на
            хлебопекарните качества и най-вече за стимулиране на развитието. Нарастването
            на добивите при пшеницата се движи обикновено в границите 10-25% в зависимост
            от състава на торовете и фазата на приложение. Този прираст позволява да се
             намалят разходите за единица продукция и да се управлява развитието на посевите.
            Ползването им е задължително в гонитбата на високите добиви.`
        },
        {
            "id": 2,
            "category":"consumables",
            "name": "Тор от кафе",
            "en_name": "cofehumus",
            "description": `Утайката от кафе е богата на азот и бактерии,
            което спомага за превръщането й органична тор. Така можете да
            добавяте вече използваното кафе в пръста , единственото което
            е необходимо да спазвате е съотношение на кафе и почва 1 към 4
             (или 25% отпадъчна утайка от кафе и 75% почва или пръст).`
        },
        {
            "id": 3,
            "category":"consumables",
            "name": "Био въглен",
            "en_name": "biochar",
            "description": `Био въгленът е въглен, използван за подобряване на почвата.
            Подобно на повечето въглени, био въглен е направен от
            биомаса чрез пиролиза. Био въгленът има потенциал да
            помогне за смекчаване на изменението на климата
            Освен това, био въгленът може да се увеличи плодородието
            на почвата на кисели почви (с ниско рН почви). Така с
            е увеличава селскостопанската производителности, и
            осигурява защита срещу някои листни и почвени болести.
            Освен това, био въгленът намалява натиска върху гори.
            Био въгленът  е стабилно твърд, богат на въглероди,
            и може да издържи в почвата в продължение на хиляди години.`
        },
        {
            "id": 4,
            "category":"consumables",
            "name": "Тор от червени червеи",
            "en_name": "biohumus",
            "description": `Биторът (Биохумусът) е органичен материал, получен в
            резултат на храненето на червените калифорнийски червеи (Lumbricus rubellus u Eisenia foetida)
             с органични остатъци и пълното им превръщане в червееви фекалии.
            Той не е само една добра хранителна среда за вашите растения.
            В него освен всички нужни за растенията хранителни вещества, хуминови киселини,
            хормони, витамини се съдържат и милиарди полезни микроорганизми, които предпазват растенията от много болести.
            Биоторът (Биохумусът) е приложим във всички области на растениевъдството`
        }
    ]
}