import {Injectable} from 'angular2/core';

@Injectable()
export class PlantsService {
    public plants:Array<any> = [
        {
            "name": "босилек",
            "en_name": "basil",
            "category": "plant",
            "description": `Босилекът (Ocimum basilicum),
                известен още като „царска билка“ (от гр. basilicum — царски),
                е едногодишно тревисто растение с голо четириръбесто стъбло.
                Разклонено достига до височина 60 cm. Листата му са яйцевидно-продълговати
                с дълги дръжки и заострени в края. Цветовете са предимно бели, много рядко
                лилаво-бели или червени. Плодовете са сухи и след като узреят се разпадат
                на четири малки семенца. Цъфти от юни до септември. Като билка и подправка
                се използва надземната част на растението, най-често стръковете в пресен
                вид, като се бере по време на цъфтежа, а за сушене — преди цъфтежа.
                Съдържа етерично масло, горчиво вещество, гликозиди, танини, органични киселини,
                минерални соли. Родина на босилека са тропиците на Азия и Африка.
                Отглежда се културно в Европа от векове.`,
            "ph": "5.5 - 6.5",
            "sun": "Слънцелюбиво",
            "water": "Нормална",
            "dishes": [{name: 'Песто', img_name: "pesto"}, {name: 'Капрезе', img_name: "kapreze"}]
        },
        {
            "name": "мента",
            "en_name": "mint",
            "category": "plant",
            "description": `Мента е род многогодишни
            тревисти растения от семейство Устноцветни. Разпространена
            е главно в северния умерен пояс. В България се срещат около
            9 вида с многобройни вариации, от които се отглежда M. piperita
            – черна мента и джоджен – M. spicata. Стъблото е клонесто,
            високо около 0,70 m, четириръбесто, листата са прости,
            продълговати, остро назъбени. Цветовете са червеникавовиолетови,
            събрани в класовидни съцветия; семената са дребни.
            Всички надземни части на растението съдържат етерично
            масло с главна съставна част ментол (45-65%). В България се култивира по поречията на реките Марица, Тунджа,
            Вит. Използването на ментата като алтернативна култура се
            състои в ментов лист, предназначен за износ или за употреба
            като трапезен чай. `,
            "ph": "7.0 - 8.0",
            "sun":"Слънцелюбиво",
            "water":"Влаголюбиво",
            "dishes": [{name: 'Мохито', img_name: "mohito"}, {name: 'Табуле с мента', img_name: "mint_tabule"}]
        },
        {
            "name": "репичка",
            "en_name": "radish",
            "category": "plant",
            "description": `Репичката (Raphanus sativus) е едногодишно кореноплодно зеленчуково
            растение от семейство Кръстоцветни. Произхожда от Средна Азия. Отглежда се като
            зеленчукова култура от около 1000 г. в Китай, Япония, Египет, Рим и Гърция.В България се
            култивират европейските форми. Репичката е студоустойчиво и светлолюбиво растение.
            Външното им оцветяване варира от розово до червено и виолетово или от комбинация от тези
            цветове. Месото е бяло, сочно, крехко и плътно
            в свежо състояние. При прояждане от червеи придобива вишневочервени нишковидни петна.
            Репичките са богати на ензими, минерални соли и витамини. Съдържат етерично масло, което
            усилва секрецията на храносмилателните жлези. Използва се за консумация в прясно състояние,
            като най-широкото му приложение е при правенето на пресни зеленчукови салати. Не са подходящи
            за термична обработка, тъй като месото се скашква и загубва вкусовите си качества. `,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "ph": "6.0 - 7.0",
            "dishes": [{name: 'Салата от репички', img_name: "radish_salad"}, {
                name: 'Репички с авокадо',
                img_name: "radish_avocado"
            }]
        },
        {
            "name": "магданоз",
            "en_name": "parsley",
            "category": "plant",
            "description": `Магданозът (Petroselinum crispum) е светлозелено, двугодишно тревисто
            растение и подправка, широко разпространена в кухните на Близкия изток, Европа и Америка.
            Дължи употребата си като освежител на дъха и до голяма степен вкусовите си качества на
            високата концентрация на хлорофил. Съдържа гликозида анин. Като подправка се използват
            два вида магданоз – къдраволист и италиански, известен още като обикновен или гладколист.
            В българската кухня се използва предимно обикновеният магданоз, а къдраволистият магданоз
            почти не е познат. Къдраволистият магданоз често се използва за декорация на ястия.
            Смята се, че обикновеният магданоз има по-силен аромат. Друг вид магданоз
            (Petroselinum tuberosum) се отглежда заради корена си.`,
            "sun":"Слънцелюбиво",
            "water":"Нормална",
            "ph": "5.0 - 7.0",
            "dishes": [{name: 'Кюфтета от магданоз', img_name: "parsley-balls"}, {name: 'Табуле', img_name: "tabule"}]
        },
        {
            "name": "риган",
            "en_name": "oregano",
            "category": "plant",
            "ph": "6.0 - 8.0",
            "description": `
            Обикновеният риган (Origanum vulgare) е многогодишно тревисто растение от семейство Устноцветни.
             Расте из храсталаци и сечища, по каменливи места и в редки гори предимно в предпланините и планините
             из цялата страна докъм 1600 m надморска височина.
            Риганът се среща в диво състояние почти навсякъде у нас. Най-често се появява по сечищата из горите,
            край горските пътеки, покрай пътищата и по влажните места. Отглежда се и като културно растение
            заради ароматичното масло, което се съдържа в цялата надземна част и особено в цветовете. Маслото
            намира широко приложение в парфюмерията. Изсушените стъбла са добър заместител на чая. Употребяват
            се при кашлица, при лекуване на белодробни заболявания, високо кръвно налягане. Като подправка и
            за лечебни цели се използва този вид, който цъфти с розововиолетови цветчета. Изсушен запазва вкуса си.`,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Гръцка салата', img_name: "greek-salad"}, {
                name: 'Пиле с риган',
                img_name: "oregano-chicken"
            }]
        },
        {
            "name": "лук",
            "en_name": "onion",
            "category": "plant",
            "description": `Кромидът (Allium cepa), наричан още кромид лук, червен лук или само лук, е
            двугодишно растение от род Лук, използвано широко в готварството. Основно се използват
            луковиците на възрастните растения преди началото на зимата. Също се използват листата
            на младите растения, често наричани пресен лук или зелен лук.
            Има характерен силен лют вкус и остра миризма, особено в луковиците. Те се омекотяват
            при готвене, при което вкусът става сладък. Луковиците имат суха външна обвивка и месеста
            слоеста вътрешност. Използвани по целия свят за кулинарни цели, те имат разнообразни форми и цветове.
            Арпаджик се наричат дребните глави кромид лук, пораснали от семе в края на първата година
            от засаждането им. Арпаджикът основно се използва за повторно засяване, за да се отгледат
            едрите глави лук. Понякога се използва и за приготвяне на ястия. `,
            "ph": "6.0 - 7.0",
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Салата с пресен лук', img_name: "fresh-onion-salad"}, {
                name: 'Яйца с лук',
                img_name: "onion-eggs"
            }]
        },
        {
            "name": "латинка",
            "en_name": "nasturtium",
            "category": "plant",
            "ph": "5.5-7.5",
            "description": `
            Латинките са род от около 80 вида едногодишни и многогодишни тревисти растения
            Tropaeolum, един от трите рода в семейство Tropaeolaceae. Родът, произхождащ от
            Южна и Централна Америка, включва няколко много популярни градински цветя, като
            най-често се отглеждат T. majus, T. peregrinum и T. speciosum. Най-издръжливият вид
            е T. polyphyllumот Чили, чиито многогодишни корени могат да оцеляват под земята при
            температури на въздуха до -15°C.  Имат ефектни цветове и заоблени щитовидни листа,
            чиято дръжка е в средата. Цветовете имат пет венчелистчета (понякога и повече),
            трипестиков плодник и фуниеобразна нектарна тръбичка отзад. Цветовете могат да
            се добавят в салати за получаване на екзотичен вид и вкус. Имат леко остър вкус,
            подобен на този на кресона. Неузрелите мариновани семена са използвани за заместител на каперсите.
            `,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Салата с латинка', img_name: "latinka-salad"}, {
                name: 'Песто с латинка',
                img_name: "latinka-pesto"
            }]
        },
        {
            "name": "синап",
            "en_name": "sinapis",
            "category": "plant",
            "ph": "6.5 - 6.8",
            "description": `Cинaпът e лютивo apoмaтнo eднoгoдишнo pacтeниe, дocтигaщo дo 40-50 cм.
            Цвeтoвeтe нa cинaпa ca жълти. Ceмeнaтa, oт koитo ce пpигoтвя и пoпyляpнaтa y нac гopчицa, ca
            мaлkи чepнo-cиви, kaфяви или блeдoжълти.
            Cъщecтвyвaт мнoгo нeгoви paзнoвиднocти, нo нaй-извecтни ca бeлия, kaфявия и чepния cинaп.
            Ceмeнaтa нa cинaпa cъдъpжaт 25-35% мacлo, koeтo ce пoлyчaвa в peзyлтaт нa пpecoвaнe, a cъщo и
             eтepичнo мacлo, koeтo ce cъcтoи oт aлил cинaпeнo /40%/, kpoтoнил cинaпeнo мacлo и cлeди oт cepoвъглepoд.
            Cлeд извличaнeтo нa мacлoтo oт ceмeнaтa нa cинaпa oт тяx ocтaвa пpax, koйтo e cypoвинa зa
            пpoизвoдcтвoтo нa пpoтивopeвмaтични мexлeми.
            Cинaпeнитe ceмeнa нe caмo възбyждaт aпeтитa, yвeличaвaйkи cekpeциятa нa cлюнka 8 пъти, нo и
            пoдпoмaгaт xpaнocмилaнeтo. Cъщo тaka ca oтличнo пpoтивoвъзпaлитeлнo, aнтиokcидaнтнo и лeko cлaбитeлнo cpeдcтвo.`,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Горчица', img_name: "mustard"}, {name: 'Пица "Рустика"', img_name: "rustica_pizza"}]
        },
        {
            "name": "мащерка",
            "en_name": "thymus",
            "category": "plant",
            "description": `Мащерката (Thymus) е род от около 350 вида ароматни многогодишни тревисти
            растения и малки храсти, високи до 40 cm, от семейство Устноцветни, растящо в Европа, Северна
            Америка и Азия. Дивата мащерка е и важен източник на нектар за пчелите. Всички видове мащерка са източници на нектар.
            Мащерката се използва за подправяне на меса, супи и яхнии. Тя е използвана във френската кухня,
            където е важна съставка на bouquet garni, както и на Herbes de Provence. Тя се използва широко
            и в карибската кухня. В някои страни от Близкия изток, подправката „заатар“ съдържа мащерка
            като насъщна съставка.
            При готвене мащерката трябва да се слага рано, за да има време да отдели етеричните си масла.
            Освен като подправка мащерката се използва широко и като билка. За лечебни цели се използват изсушените ѝ цветове.
            Притежава антисептично, противовъзпалително, отхрачващо, спазмолитично, болкоуспокояващо действие.
            `,
            "ph": "5.5 - 7.0",
            "water":"Сухолюбиво",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Ориз с мащерка', img_name: "thyme-rice"}, {
                name: 'Пиле с мащерка',
                img_name: "thyme-chicken"
            }]
        },
        {
            "name": "манголд",
            "en_name": "chard",
            "category": "plant",
            "ph": "6.0 - 6.8",
            "description": `Манголдът е известен като chard или Swiss chard. На български пък може да сте го
            срещали и като спанаково или листно цвекло. Листата му наистина приличат на тези на спанака или
            цвеклото, с тази разлика, че са малко по-широки и къдрави. Дръжките са по-плътни, като според
            различните разновидности може да са в бял, жълт или червен цвят.
            Младите листа на манголда са крехки и отлично се вписват в салати – по същия начин, по който
            бихте използвали спанак или други зеленолистни зеленчуци. Дръжките се изрязват, защото не са
            подходящи за сурова консумация, но спомойно могат да бъдат сготвени. По-възрастните листа е
            по-добре да бъдат задушени или сготвени – стават отлична плънка за баници, като добавка в
            ястия, на супа или в пюрета, а в Турция завиват и сърми в тях.`,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Топла салата с манголд', img_name: "warm-mangold-sald"}, {
                name: 'Тофу с манголд',
                img_name: "mangold-tofu"
            }]
        },
        {
            "name": "слънчоглед",
            "en_name": "sunflower",
            "category": "plant",
            "specific": "sprout",
            "ph": "6.0 - 7.5",
            "description": `Слънчогледът произхожда от степта на Северна Америка, където и сега се срещат диви форми.
            В Европа растението е пренесено през 1510 г. и засято в ботаническата градина на Мадрид.
            В началото се е отглеждал като декоративно растение и за семки.
            Като маслодайно растение слънчогледът най-вероятно е използван от коренното американско население.
            Счита се, че индианците са получавали масло, с което са мазали косите и тялото си или са
            получавали бои за оцветяване на облеклата си. Като маслодайна култура, обаче се отглежда
            от началото на 19 век във Воронежка област ,Русия, откъдето обратно е пренесен в Европа.
            По данни на ФАО площта на слънчогледа в света надхвърля 100 млн. дка и той се явява трета
            по важност маслодайна култура след соята и рапицата.
            `,
            "water":"Влаголюбиво",
            "sun":"Слънцелюбиво",
            "dishes": [{
                name: 'Златно цветкло със слънчогледени кълнове',
                img_name: "golden-beet-sunflower-salad"
            }, {name: 'Салата със слънчогледови кълнове', img_name: "sunflower-sprout-salad"}]
        },
        {
            "name": "чубрица",
            "en_name": "savory",
            "category": "plant",
            "ph": "6.7 - 7.3",
            "description": `
            Чубрицата (Satureja) е род от около 30 вида едногодишни или многогодишни тревисти растения и
            малки храсти от семейство Устноцветни, растящи в топлите умерени райони на Северното полукълбо.
            Те са ниски растения, растящи на сухи слънчеви места. Достигат 15-50 cm на височина и имат малки листа дълги 1-3 cm.  В кулинарството се използва за подправка най-вече Градинската чубрица.
            Използва се надземната част, брана преди, по време или след цъфтежа. Суши се на сянка (35 градуса).
            Изсушената билка е със зелен цвят, характерна миризма и леко лют вкус. Като подправка най-често се
            използва, смесена със сол, червен пипер, черен пипер и сминдух.
            Освен като подправка, чубрицата се използва в официалната медицина при стомашно-чревни заболявания
            (стимулира стомашната и чревна дейност), като болкоуспокояващо и укрепващо средство. Има отхрачващо действие.
            `,
            "water":"Сухолюбиво",
            "sun":"Нормално",
            "dishes": [{name: 'Лятна брускета', img_name: "savory-brusceta"}, {
                name: 'Вегитариански Киш',
                img_name: "savory-quiche"
            }]
        },
        {
            "name": "житняк",
            "en_name": "agropyron",
            "category": "plant",
            "ph": "6.0 - 7.0",
            "description": `
            Многогодишно тревисто растение с дълго пълзящо вкореняващо се във възлите коренище, издънки и изправени,
            60-100 см високи цветоносни стебла с плътни възли и кухи междувъзлия. Листата плоски линейни, 4-8 мм широки.
            Цветовете 4-7, събрани в многобройни класчета, формиращи удължен рехав клас. Плодът зърно. Цъфти юни-юли.
            Расте по тревисти места, пасища и ливади, по открити и не обработвани места, често на овлажнени терени.
            Разпространено из цялата страна от низите до към 1500 м надморска височина. Среща се в цяла Европа.
            Основно действие е oтхрачващо, противовъзпалително, диуретично.
            Българската народна медицина използва противовъзпалителната активност на дрогата, като я препоръчва
            при лечението на ревматизма, при възпалителни процеси, заангажиращи пикочните пътища (цистити,
            цистопиелити). Дрогата се предлага също така и за лечение на някои нарушения от обменен характер –
            подагра – усилва излъчването на повишеното при тази болест съдържание на пикочна киселина в организма.`,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Смути', img_name: "wheatgrass-smoothie"}, {
                name: 'Фреш с цвекло и житняк',
                img_name: "wheatgrass-beet-cucumber"
            }]
        },
        {
            "name": "sage",
            "en_name": "sage",
            "category": "plant",
            "description": `
            Sage или салвия (Salvia officinalis) е малък вечнозелен храст с дървенисти стъбла,
            сивкави листа и сини до виолетови цветове, растящ в Южна Европа и Средиземноморието,
            а също и в югозападната полупустинна част на Северна Америка.
            Той се отглежда много като подправка и билка.
            Използва се за чайове, запарки и отвари, за които се смята, че имат успокоително
            действие и подпомагат храносмилането. Има свойства за консервиране, овкусявания.
            Пример при сирене; И става като подправка в готвенето. В някои части на Европа,
            особено на Балканите, градинският чай се отглежда и за получаване на етерично масло,
            въпреки че обикновено в тези случаи заедно с него се събират и обработват и други
            сродни видове като Salvia triloba.`,
            "ph": "5.5 - 6.5",
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Свинско със Sage', img_name: "sage-pork"}, {
                name: 'Брюкселско зеле със Sage',
                img_name: "sage-bruccells"
            }]
        },
        {
            "name": "грах",
            "en_name": "pea",
            "category": "plant",
            "specific": "sprout",
            "description": `
            Грахът (Pisum sativum) е биологичен вид, растение от семейство Бобови (Fabaceae).
            Отглежда се като домашна култура за прехрана по целия свят. Пониците на пролетните
            сортове грах понасят кратки застудявания до –5, –6°С. От разновидностите с обагрени
            цветове има сортове, които издържат на кратки застудявания до –18, –20°С и се отглеждат
            като зимна култура в райони със сравнително кратки колебания на температурата през
            зимния период. Най-бързо расте грахът при температура около 25°С. При по-ниска температура
            той също расте добре и се развива, но вегетационният му период се удължава, а при по-висока
            температура се скъсява. Грахът се развива най-добре при умерено влажни условия.  За създаване
            на условия за благоприятно развитие на грудковите бактерии, а оттам за правилно азотно хранене
            на граховите растения е необходима добре обработена и разрохкана почва с достатъчно влага и
            добра аерация. В суха почва и в отсъствие на въздух грудковите бактерии постепенно загиват.
            `,
            "ph": "6.0 - 7.5",
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{
                name: 'Пържени грахови кълнове',
                img_name: "fry-pea-sprouts"
            }, {name: 'Салата от грахови кълнове', img_name: "pea-shoots-salad"}]
        },
        {
            "name": "маруля",
            "en_name": "lettuce",
            "category": "plant",
            "description": `
            Марулите виреят доста добре в умерените ширини. Те са от семейство Asteraceae и се култивират
            най-вече заради крехките си листа, приготвени на салати.
            Марулята не бива да се бърка с градинската салата, макар че няма голяма разлика между двете.
            При повечето сортове градинска салата имат леко закръглена форма, докато марулите са с
            по-издължени и с по-плътни листа при някои сортове. Има много и различни видове марули -
            бостънски, китайски, айсберг, лятна маруля, Лоло росо, Дъбов лист, белгийска и къдрава цикория.
            Крехките листа маруля имат свеж, леко горчив вкус, който се дължи на млечния сок,
            намиращ се в тях.
            Историята на марулята започва някъде в Египет, като дори е изобразена по стените
            на гробниците на фараоните. По-нататък във времето римляните култивират зеленолистното растение .
            По времето на император Домициан се създава традицията тя да се консумира като предястие с различни сосове.
            `,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "ph": "6.0 - 7.0",
            "dishes": [{name: 'Зелена салата', img_name: "green-saald"}, {
                name: 'Сърми с маруля',
                img_name: "lettuce-wraps"
            }]
        },
        {
            "name": "леща",
            "en_name": "lentil",
            "category": "plant",
            "description": `
            Лещата е растение на континенталния и субтропичния климат. У нас тя се отглежда като пролетна култура,
            тъй като не страда от късни слани и студове. При подходяща температура и влага семената поникват
            за 8-10 дни от момента на засяването. Поникналите млади растения могат да издържат без повреди до минус 6°С.
            След поникването растенията не се нуждаят от много влага, но изискват сравнително повече топлина.
            Тя е самоопрашващо се растение. Опрашването се извършва още преди отварянето на цвета.
            Вегетационният период от поникването до узряването при различните сортове продължава от 70
            до 115 дни. Дребносеменните сортове имат по-кратък вегетационен период от едросеменните.
            Към почвата тя не е много взискателна. Най-добри за нея са дълбоките глинесто-песъчливи почви,
             леки черноземи, канелени и сиви горски почви, съдържащи достатъчно хранителни вещества и вар.
            `,
            "ph": "5.5 - 7.0",
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Кълнове от леща с манго', img_name: "lentil-mango"}, {
                name: 'Кълнове от леща с булгур',
                img_name: "lentil-bulger"
            }]
        },
        {
            "name": "маточина",
            "en_name": "balm",
            "category": "plant",
            "ph": "6.0 - 7.0",
            "description": `
            Маточината (Melissa officinalis) е многогодишно тревисто растение от семейство Устноцветни,
            растящо в южна Европа и Средиземноморието.За нейна родина се смятат земите около Средиземно море.
            Култивира се в много страни на Европа и Северна Америка.
            На височна достига 70-150 cm. Листата имат лека миризма на лимон. В края на лятото се появяват малки цветове,
            пълни с нектар. Те привличат пчели, откъдето идва и наименованието Melissa (гр. „пчела“).
            Ароматът се дължи на терпените цитронелал, цитронелол, цитрал и гераниол. Расте из храсталаци
            и редки гори по тревисти и каменисти места из цялата страна.
            Надземната част на маточината е използвана от древните гърци и римляните заради приятния ѝ
            освежителен мирис, напомнящ този на лимонова кора.
            Използва се при приготвяне на болета, ликьори. Не бива да се смесва със силни подправки
            като мента, индийско орехче, джинджифил.
             `,
            "water":"Влаголюбиво",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Студен чай', img_name: "lemon-balm-ice-tea"}, {
                name: 'Торта',
                img_name: "lemon-balm-cake"
            }]
        },
        {
            "name": "komatsuna",
            "en_name": "komatsuna",
            "category": "plant",
            "ph": "5.5 - 6.5",
            "description": `
            Komatsuna или Японски горчичен спанак е листно растение. Той е вариант на зелето.
            За продажба се отглежда в Япония и Тайван. Името му идва от японското за "Зеленина от
            Коматсу", което се свързва  със село където растението е било широко отглеждано.
            Може да пържи, вари , да се добавя в супи, пресни салата и  е добър източник на калций.
            Листата на коматсуната могат да се ядат на всеки етап от техния растеж. В зрелия си
            период растението е тъмно зелено със зелени черти,, около 30 сантиметри дълго и 18 широко.
            Най често се отглежда в есента или пролетта, тъй като не може да издържа на много високи
            и много ниски температури. Използва се за фураж в някои азиатски държави.
            `,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Тофу', img_name: "komatsuna-tofu"}, {
                name: 'Салата с Komatsuna',
                img_name: "komatsuna-salad"
            }]
        },
        {
            "name": "сминдух",
            "en_name": "fenugreek",
            "category": "plant",
            "ph": "6.0 - 7.0",
            "description": `
            Сминдухът (Trigonella foenum-graecum), известен още като чимен, e едногодишно растение от
            семейство Бобови. Семената и листата му се използват като подправка. Родината на чимена
            са земите около Средиземно море, но той е познат и в Китай, Индия и Северна Африка.
            Семената му са използвани като подправка и лечебно растение от египтяни, гърци и римляни.
             Египетските воини са го ползвали като напитка преди битка.
            Изсушената и стрита ароматна подправка, която в този вид е една от основните съставки в
            традиционната българска смес от подправки шарена сол. При нас за шарена сол се ползва
            предимно полски сминдух — Trigonella caerulea.
            В други страни се ядат и кълновете, свежата листна маса се слага в картофена яхния.
            `,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Шарена сол', img_name: "sharena_sol"}, {
                name: 'Салата от кълнове на сминдух',
                img_name: "sminduh-salad"
            }]
        },
        {
            "name": "лен",
            "en_name": "linum",
            "category": "plant",
            "ph": "5.0 - 7.0",
            "description": `
            Ленът (Linum usitatissimum) е познат на човечеството от незапомнени времена и се счита
            за една от най-ранно култивираните култури. Здравословните ползи от него са доказани
            чрез различни и огромни на брой изследвания, които са категорични, че лененото семе и
            неговия състав от фибри, мастни киселини и витамини, са същинска аптека за нашето
            здраве и важна част от здравословния хранителен режим.
            Ленът е от семейство Ленови (Linaceae) и е род едногодишни и многогодишни тревисти
            растения и полухрасти. Тази култура се отглежда главно в три направения – маслодаен,
            от който се добива лененото масло, влакнодаен, от който се добиват влакна от стеблата,
            междинен, който съчетава в себе си и двете функции – за масло и за влакна. Познати са
            още планински и полузимен лен. Културния лен е масов и се отглежда за ленено масло и за влакна.`,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Хляб', img_name: "linen-bread"}, {name: 'Крекери', img_name: "linen-kreker"}]
        },
        {
            "name": "къдрaвo зеле",
            "en_name": "kale",
            "category": "plant",
            "ph": "6.0 - 7.5",
            "description": `
            Кейл, Листно зеле, Къдраво зеле (Kale, Curly kale, Brassica oleracea Acephala Group) представлява
            култивиран вид зеле, едногодишно или двугодишно растение, което образува само листна маса без глави,
            както останалите подобни видове. Смята се, че е по-близо до дивото зеле, отколкото до повечето домашни
            форми на този зеленчук.
            До края на Средновековието, листното зеле е един от най-разпространените зелени зеленчуци в цяла Европа.
            Къдрави, характерни сортове зеле вече са съществували заедно с гладко листни сортове в Гърция през
            четвърти век преди новата ера. Тези форми, които са били посочени от римляните като Sabellian kale,
            се считат за предци на съвременния кейл. Някои от сортовете кейл са по-високи и не толкова подходящи
            за консумация, а други по-компактни и симетрични и с добро качество като хранителен продукт.
            Много от тях, обаче, са груби, притежават нежелано оцветяване и са непривлекателни като хранителен
            продукт, както са и несмилаеми.
            `,
            "water":"Нормална",
            "sun":"Сянколюбиво",
            "dishes": [{
                name: 'Маринована салата',
                img_name: "kale-marinated-salad"
            }, {name: 'Kъдраво зеле със наденица', img_name: "sausage-kale-saute-polenta"}]
        },
        {
            "name": "копър",
            "en_name": "dill",
            "category": "plant",
            "ph": "5.5 - 7.5",
            "description": `
            Копърът (Anethum graveolens) е едногодишно растение с кратък живот, което се използва
            за подправка на ястия и като съставна част на някои медикаменти. Още древните римляни
            считали, че копърът има тайнствена, чудодейна сила. Старите гърци демонстрирали благосъстоянието
            си като горели ароматно масло от копър. Гладиаторите получавали храна, обилно подправена с
            копър, за да бъдат силни и издръжливи. В древен Вавилон го отглеждали с лечебна цел.
            Там цар Мардукапалитина II уредил градина, където между другите лечебни растения отглеждал
            и копър. В Европа е на почит от времето на Карл Велики (IX в.). По-голяма популярност добива
            през XVI век във Флоренция и Болоня по времето на Катерина Медичи. Използвали го като съставка
            при приготвянето на любовен еликсир, а също и при предпазване от черна магия.
            `,
            "water":"Сухолюбиво",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Таратор', img_name: "tarator"}, {name: 'Сиренки', img_name: "cheese-dill"}]
        },
        {
            "name": "сибирски лук",
            "en_name": "chives",
            "category": "plant",
            "description": `
            Сибирският лук (Allium schoenoprasum, познат още като див лук, резанец, шивес, салатен лук)
            е вид лук, местен за Европа и Азия. Той е луковично тревисто многогодишно растение,
            достигащо 30-50 cm височина. Луковиците са източени конични, 2-3 cm дълги и 1 cm широки,
            и растат нагъсто в групи от корените. Листата са кухи тръбообразни, дълги до 50 cm, 2-3 mm
            в диаметър, с мека структура. Цветовете са бледоморави звездовидни с шест венчелистчета,
            широки 1-2 cm и растат в гъсти съцветия от по 10-30 заедно. Преди да се отвори, съцветието
            е обвито в хартиеподобен прицветник. Семената се образуват в малка семенна кутийка с три
            прегради и узряват през лятото.`,
            "ph": "6.0 - 7.0",
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{
                name: 'Картофено пюре със сибирски лук',
                img_name: "patatoes-chives"
            }, {name: 'Сьомга със сибирски лук', img_name: "almond-salmon-chives"}]
        },
        {
            "name": "кориандър",
            "en_name": "cilantro",
            "category": "plant",
            "ph": "6.5 - 7.5",
            "description": `
            Кориандърът (Coriandrum sativum) едногодишно тревисто растение, което се използва широко като подправка в
            средиземноморската, индийската, латиноамериканската и близко- и далекоизточната кухня. Всички части на
            растението могат да се ядат, но пресните листа и сушените семена се използват най-често в кухнята.
            Листата имат вкус, силно различаващ се от този на семената. Пресните листа са необходима съставка в
            много азиатски и мексикански сосове и зеленчукови пюрета. Популярен е в Латинска Америка и е съставка
            на мексиканското гуакамоле. Нарязани на ситно листа от кориандър се използват и за гарниране на различни
            ястия, но не бива те самите да бъдат готвени, защото топлината бързо унищожава аромата им.
            Натрошените семена имат лимонов вкус. Описват го също като топъл, орехов, пикантен или дори портокалов.
            Обикновено се сушат, но могат да се ядат и зелени. Смлените семена от кориандър са важна съставка на кърито.
            `,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{name: 'Пиле с кориандър', img_name: "chicken_coriander"}, {
                name: 'Картофена супа с кориандър',
                img_name: "coriander-soup"
            }]
        },
        {
            "name": "зеле",
            "en_name": "cabbage",
            "category": "plant",
            "description": `
            Известно е, че първи започнали да отглеждат зеле древните иберийци, населяващи днешна Испания.
            Tе наричали зелето "аши". После то е пренесено в Гърция, Египет и Рим, а след това и в други държави.
            През първите години на новата ера зелето е станало известно на южните славяни, живеещи на Балканския полуостров.
            Някои наричат зелето "северен лимон". А това не е случайно – витамин С в него е повече, отколкото в лимоните и портокалите.
            Разбира се, много от качествата, приписвани на зелето, не са потвърдени от съвременната медицина,
            но то действително е полезно. Особено ценено е зелето у древните гърци и римляни, които го поднасяли
            за пиршествата варено, с различни подправки, а жителите на Древен Египет го сервирали като изискано
            лакомство в края на обедното хранене.
            `,
            "ph": "6.0 - 7.5",
            "water":"Влаголюбиво",
            "sun":"Нормално",
            "dishes": [{name: 'Свинско със зеле', img_name: "pork-cabbage"}, {
                name: 'Капрезе',
                img_name: "apples-cabagge"
            }]
        },
        {
            "name": "елда",
            "en_name": "fagopyrum",
            "category": "plant",
            "ph": "6.0 - 6.5",
            "description": `
            Елда (Fagopyrum) е род покритосеменни растения от семейство Лападови (Polygonaceae).
            Някои видове се използват като зърнена храна, въпреки че не са част от семейство Житни
            (Poaceae). За първи път хората започват да я отглеждат още преди 6000 години в Югоизточна Азия.
            В Индия наричат елдата "черен ориз", а в другите страни е известна като "черна пшеница".
            След старта на масовото й отглеждане тя бързо си спечелва славата на една от
            най-разпространените храни за по-бедните обществени слоеве. Родината на елдата е
            Индия, но най-популярна е в Русия (наричат я „гречка“). Едногодишната елда е растение
            с бели цветове и с плод - торбести кутийки.  Тя увеличава мускулната сила и издръжливост.
            Също така е полезна за спортуващите. Съдържа желязо, калций, калий, фосфор, йод, цинк и др.
            Елдата подхранва кожата, косата и ноктите. Също съдържа органични киселини  и витамините
            А, С, PP, Р. Богата е на флавоноиди, които помагат за забавяне процесите на стареене.
            `,
            "water":"Нормална",
            "sun":"Слънцелюбиво",
            "dishes": [{
                name: 'Шоколадови бисквити с елда',
                img_name: "buckwheat_choco_chip_cookies"
            }, {name: 'Ризото с елда', img_name: "buckwheat-risotto"}]
        },
        {
            "name": "броколи",
            "en_name": "broccoli",
            "category": "plant",
            "description": `
            Броколите (Brassica oleracea var. italica) са подвид растение от семейство Кръстоцветни, чиято
            цветна глава се използва като зеленчук. Думата броколи произлиза от италиански (broccolo) и
            означава в множествено число "цъфтящи върхове на зелето".
            Броколите обикновено се варят във вода или на пара, но могат да се консумират сурови и стават
            популярни като суров зеленчук сервиран в ордьоври.
            Броколите се класифицират в групата на сорт Италика от вида Brassica oleracea.
            Броколите имат големи цветни глави, обикновено зелени на цвят, подредени като разклонени
            клони върху дебело стъбло, годно за консумация. Цветните глави са заобиколени от листа.
            Броколите приличат най-много на карфиол, но са различна група от същия вид.
            Те произхождат от култивирани зелеви листни култури в северното Средиземноморие
            около 6-ти век пр.н.е. От времето на Римската империя, броколите се смятат за
            уникално ценна храна сред италианците.
            `,
            "water":"Влаголюбиво",
            "sun":"Слънцелюбиво",
            "ph": "6.0 - 7.0",
            "dishes": [{name: 'Пюре с броколи', img_name: "broccoli-potatoes"}, {
                name: 'Спагети с броколи',
                img_name: "broccoli-pasta"
            }]
        },
        {
            "name": "цвекло",
            "en_name": "beet",
            "category": "plant",
            "specific": "sprout",
            "description": `
            За консумация в кулинарията обикновено се използва коренът на цвеклото.
            Той има силно червен цвят. Яде се в суров вид на салата или в прясно изцедени
            сокове или в комбинация на варени зеленчуци и туршия. Голяма част от търговската
            продукция се преработва в сварен и стелиризиран вид. В Източна Европа популярно
            ястие е супа от цвекло, във вид на студен борш.
            Листата на цвеклото също са годни за консумация. Могат да се приготвят варени
            или на пара, като имат вкус и консистенция подобни на тези на спанака.
            Изключително богати са на антиоксиданта бета каротин.
            Пигменти наречени бетацианини придавата червеният цвят на цвеклото.
            `,
            "water":"Влаголюбиво",
            "sun":"Слънцелюбиво",
            "ph": "6.2 - 7.0",
            "dishes": [{
                name: 'Салата с кълнове цвекло',
                img_name: "beet-sprouts-salad"
            }, {name: 'Пица с кълнове цвекло', img_name: "pizza-beet-sprouts"}]
        },
        {
            "name": "рукола",
            "en_name": "rucola",
            "category": "plant",
            "description":`
            Рукола (Eruca sativa или Brassica eruca) или ерука, аругула, рокет, е едногодишно растение от семейство
            Кръстоцветни, което печели все по-голяма популярност като съставка в зеленчуковите салати у нас, а
            по Средиземноморието се използва от дълги години.
            Растението е разпространено в Близкия Изток, преди всичко в Турция, Йордания и Мароко. Вирее в
            Централна и Източна Европа, Северна, Средна, Югозападна, Източна и Централна Азия, Северна Африка,
            Австралия. Среща се като плевел в житните посеви, а понякога расте край железопътни линии.
            У нас могат да се намерят семена от 2 вида - Рукола колтивата (Rucola coltivata) и Рукола
            селватика (Rucola selvatica). Огромна част от руколата на нашия пазар идва от Израел,
            а по-малко количество от Гърция.
            Руколата има родство с горчицата. Растението достига височина до 60 см, като листата
            са сравнително месести, с власинки, със специфичен аромат.  Цветовете на руколата са
            жълти или бели и цъфтят от май до юли, дава плод през юли-август.
            `,
            "water":"Влаголюбиво",
            "sun":"Нормално",
            "ph": "6.0 - 7.0",
            "dishes": [{name: 'Рукола с репички', img_name: "radish-rukola-salad"}, {
                name: 'Рукола с айсберг',
                img_name: "rukola-iceberg"
            }]
        }
    ];

    public getByEnName(en_name:string):any {
        return this.plants.filter(p=>p.en_name === en_name)[0];
    }
}